# dict to map LINEUP(KOR) -> simplified version
lineups_simplified = {
    "구찌 다이애나": "다이애나",
    "재키 1961": "재키",
    "구찌 1955 홀스빗": "홀스빗",
    "구찌 홀스빗 1955": "홀스빗",
    "GG 마몽": "마몽",
    "디오니서스": "디오니서스",
    "오피디아": "오피디아",
    "실비": "실비",
    "구찌 주미": "주미",
    "패들락": "패들락",
    "더블G": "더블G",
}

lineup_map = {
    "구찌 다이애나": ["다이애나"],
    "재키 1961": ["재키", "1961"],
    "구찌 1955 홀스빗": ["홀스빗", "1955"],
    "구찌 홀스빗 1955": ["홀스빗", "1955"],
    "GG 마몽": ["마몽", "마몬트", "마몽"],
    "디오니서스": ["디오니서스", "디오니소스", "디오니수스"],
    "오피디아": ["오피디아"],
    "실비": ["실비"],
    "구찌 주미": ["주미"],
    "패들락": ["패들락", "패드락", "페들락", "페드락"],
    "더블G": ["더블G"],
}
